       >>SOURCE FORMAT IS FREE
       IDENTIFICATION DIVISION.
       PROGRAM-ID. RELMENU.
       AUTHOR. Lilian.
       PROCEDURE DIVISION.
           DISPLAY "Modulo de Relatorios (Nao implementado)".
           GOBACK.
